nevinxu/HM502B2/platform/CMSIS/Include/device/MKL17Z4/MKL17Z4_nv.h
#define HW_NV_FOPT(x)            (*(__I hw_nv_fopt_t *) HW_NV_FOPT_ADDR(x))
#define HW_NV_FOPT_RD(x)         (HW_NV_FOPT(x).U)
/*@}*/

/*
 * Constants & macros for individual NV_FOPT bitfields
 */

/*!
 * @name Register NV_FOPT, field LPBOOT0[0] (RO)
 *
 * Values:
 * - 00 - Core and system clock divider (OUTDIV1) is 0x7 (divide by 8) when
 *     LPBOOT1=0 or 0x1 (divide by 2) when LPBOOT1=1.
 * - 01 - Core and system clock divider (OUTDIV1) is 0x3 (divide by 4) when
 *     LPBOOT1=0 or 0x0 (divide by 1) when LPBOOT1=1.
 */
/*@{*/
#define BP_NV_FOPT_LPBOOT0   (0U)          /*!< Bit position for NV_FOPT_LPBOOT0. */
#define BM_NV_FOPT_LPBOOT0   (0x01U)       /*!< Bit mask for NV_FOPT_LPBOOT0. */
#define BS_NV_FOPT_LPBOOT0   (1U)          /*!< Bit field size in bits for NV_FOPT_LPBOOT0. */

/*! @brief Read current value of the NV_FOPT_LPBOOT0 field. */
#define BR_NV_FOPT_LPBOOT0(x) (HW_NV_FOPT(x).B.LPBOOT0)
/*@}*/

/*!
 * @name Register NV_FOPT, field BOOTPIN_OPT[1] (RO)
 *
 * Values:
 * - 00 - Force Boot from ROM if BOOTCFG0 asserted, where BOOTCFG0 is the boot
 *     config function which is muxed with NMI pin
 * - 01 - Boot source configured by FOPT (BOOTSRC_SEL) bits
 */
/*@{*/
#define BP_NV_FOPT_BOOTPIN_OPT (1U)        /*!< Bit position for NV_FOPT_BOOTPIN_OPT. */
#define BM_NV_FOPT_BOOTPIN_OPT (0x02U)     /*!< Bit mask for NV_FOPT_BOOTPIN_OPT. */
#define BS_NV_FOPT_BOOTPIN_OPT (1U)        /*!< Bit field size in bits for NV_FOPT_BOOTPIN_OPT. */

/*! @brief Read current value of the NV_FOPT_BOOTPIN_OPT field. */
#define BR_NV_FOPT_BOOTPIN_OPT(x) (HW_NV_FOPT(x).B.BOOTPIN_OPT)
/*@}*/

/*!
 * @name Register NV_FOPT, field NMI_DIS[2] (RO)
 *
 * Values:
 * - 00 - NMI interrupts are always blocked
 * - 01 - NMI_b pin/interrupts reset default to enabled
 */
/*@{*/
#define BP_NV_FOPT_NMI_DIS   (2U)          /*!< Bit position for NV_FOPT_NMI_DIS. */
#define BM_NV_FOPT_NMI_DIS   (0x04U)       /*!< Bit mask for NV_FOPT_NMI_DIS. */
#define BS_NV_FOPT_NMI_DIS   (1U)          /*!< Bit field size in bits for NV_FOPT_NMI_DIS. */

/*! @brief Read current value of the NV_FOPT_NMI_DIS field. */
#define BR_NV_FOPT_NMI_DIS(x) (HW_NV_FOPT(x).B.NMI_DIS)
/*@}*/

/*!
 * @name Register NV_FOPT, field RESET_PIN_CFG[3] (RO)
 *
 * Values:
 * - 00 - RESET pin is disabled following a POR and cannot be enabled as reset
 *     function
 * - 01 - RESET_b pin is dedicated
 */
/*@{*/
#define BP_NV_FOPT_RESET_PIN_CFG (3U)      /*!< Bit position for NV_FOPT_RESET_PIN_CFG. */
#define BM_NV_FOPT_RESET_PIN_CFG (0x08U)   /*!< Bit mask for NV_FOPT_RESET_PIN_CFG. */
#define BS_NV_FOPT_RESET_PIN_CFG (1U)      /*!< Bit field size in bits for NV_FOPT_RESET_PIN_CFG. */

/*! @brief Read current value of the NV_FOPT_RESET_PIN_CFG field. */
#define BR_NV_FOPT_RESET_PIN_CFG(x) (HW_NV_FOPT(x).B.RESET_PIN_CFG)
/*@}*/

/*!
 * @name Register NV_FOPT, field LPBOOT1[4] (RO)
 *
 * Values:
 * - 00 - Core and system clock divider (OUTDIV1) is 0x7 (divide by 8) when
 *     LPBOOT0=0 or 0x3 (divide by 4) when LPBOOT0=1.
 * - 01 - Core and system clock divider (OUTDIV1) is 0x1 (divide by 2) when
 *     LPBOOT0=0 or 0x0 (divide by 1) when LPBOOT0=1.
 */
/*@{*/
#define BP_NV_FOPT_LPBOOT1   (4U)          /*!< Bit position for NV_FOPT_LPBOOT1. */
#define BM_NV_FOPT_LPBOOT1   (0x10U)       /*!< Bit mask for NV_FOPT_LPBOOT1. */
#define BS_NV_FOPT_LPBOOT1   (1U)          /*!< Bit field size in bits for NV_FOPT_LPBOOT1. */

/*! @brief Read current value of the NV_FOPT_LPBOOT1 field. */
#define BR_NV_FOPT_LPBOOT1(x) (HW_NV_FOPT(x).B.LPBOOT1)
/*@}*/

/*!
 * @name Register NV_FOPT, field FAST_INIT[5] (RO)
 *
 * Values:
 * - 00 - Slower initialization
 * - 01 - Fast Initialization
 */
/*@{*/
#define BP_NV_FOPT_FAST_INIT (5U)          /*!< Bit position for NV_FOPT_FAST_INIT. */
#define BM_NV_FOPT_FAST_INIT (0x20U)       /*!< Bit mask for NV_FOPT_FAST_INIT. */
#define BS_NV_FOPT_FAST_INIT (1U)          /*!< Bit field size in bits for NV_FOPT_FAST_INIT. */

/*! @brief Read current value of the NV_FOPT_FAST_INIT field. */
#define BR_NV_FOPT_FAST_INIT(x) (HW_NV_FOPT(x).B.FAST_INIT)
/*@}*/

/*!
 * @name Register NV_FOPT, field BOOTSRC_SEL[7:6] (RO)
 *
 * Values:
 * - 00 - Boot from Flash
 * - 10 - Boot from ROM
 * - 11 - Boot from ROM
 */
/*@{*/
#define BP_NV_FOPT_BOOTSRC_SEL (6U)        /*!< Bit position for NV_FOPT_BOOTSRC_SEL. */
#define BM_NV_FOPT_BOOTSRC_SEL (0xC0U)     /*!< Bit mask for NV_FOPT_BOOTSRC_SEL. */
#define BS_NV_FOPT_BOOTSRC_SEL (2U)        /*!< Bit field size in bits for NV_FOPT_BOOTSRC_SEL. */

/*! @brief Read current value of the NV_FOPT_BOOTSRC_SEL field. */
#define BR_NV_FOPT_BOOTSRC_SEL(x) (HW_NV_FOPT(x).B.BOOTSRC_SEL)
/*@}*/

/*******************************************************************************
 * hw_nv_t - module struct
 ******************************************************************************/
/*!
 * @brief All NV module registers.
 */
#pragma pack(1)
typedef struct _hw_nv
{
    __I hw_nv_backkey3_t BACKKEY3;         /*!< [0x0] Backdoor Comparison Key 3. */
    __I hw_nv_backkey2_t BACKKEY2;         /*!< [0x1] Backdoor Comparison Key 2. */
    __I hw_nv_backkey1_t BACKKEY1;         /*!< [0x2] Backdoor Comparison Key 1. */
    __I hw_nv_backkey0_t BACKKEY0;         /*!< [0x3] Backdoor Comparison Key 0. */
    __I hw_nv_backkey7_t BACKKEY7;         /*!< [0x4] Backdoor Comparison Key 7. */
    __I hw_nv_backkey6_t BACKKEY6;         /*!< [0x5] Backdoor Comparison Key 6. */
    __I hw_nv_backkey5_t BACKKEY5;         /*!< [0x6] Backdoor Comparison Key 5. */
    __I hw_nv_backkey4_t BACKKEY4;         /*!< [0x7] Backdoor Comparison Key 4. */
    __I hw_nv_fprot3_t FPROT3;             /*!< [0x8] Non-volatile P-Flash Protection 1 - Low Register */
    __I hw_nv_fprot2_t FPROT2;             /*!< [0x9] Non-volatile P-Flash Protection 1 - High Register */
    __I hw_nv_fprot1_t FPROT1;             /*!< [0xA] Non-volatile P-Flash Protection 0 - Low Register */
    __I hw_nv_fprot0_t FPROT0;             /*!< [0xB] Non-volatile P-Flash Protection 0 - High Register */
    __I hw_nv_fsec_t FSEC;                 /*!< [0xC] Non-volatile Flash Security Register */
    __I hw_nv_fopt_t FOPT;                 /*!< [0xD] Non-volatile Flash Option Register */
} hw_nv_t;
#pragma pack()

/*! @brief Macro to access all NV registers. */
/*! @param x NV module instance base address. */
/*! @return Reference (not a pointer) to the registers struct. To get a pointer to the struct,
 *     use the '&' operator, like <code>&HW_NV(FTFA_FlashConfig_BASE)</code>. */
#define HW_NV(x)       (*(hw_nv_t *)(x))

#endif /* __HW_NV_REGISTERS_H__ */
/* EOF */
